CSI API ETABS v1
cDesignCompositeColumn.GetCode Method
 Retrieves the composite column design code.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCode(
	ref string CodeName
)
Function GetCode (
	ByRef CodeName As String
) As Integer
Dim instance As cDesignCompositeColumn
Dim CodeName As String
Dim returnValue As Integer
returnValue = instance.GetCode(CodeName)
int GetCode(
	String^% CodeName
)
abstract GetCode :
        CodeName : string byref -> int
Parameters
CodeName
Type: System.String
 For ETABS, this is one of the following composite column design code names.
AISC 360-10
AISC 360-16
Chinese 2010
Eurocode 4-2004
Return Value
Type: Int32
 Returns zero if the code is successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim CodeName As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get composite column design code
   ret = SapModel.DesignCompositeColumn.GetCode(CodeName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace